{
  "id": "solo",
  "name": "Solo",
  "avatar": "/solo.jpg",
  "initialState": "welcome",
  "states": {
    "welcome": {
      "message": "Hey there! I'm Solo. I noticed you're interested in Star Wars. How can I help you today?",
      "quickReplies": [
        {
          "text": "Tell me about your adventures",
          "nextState": "adventures_deep"
        },
        {
          "text": "Tell me about the Millennium Falcon",
          "nextState": "falcon_deep"
        },
        { "text": "Tell me about Chewbacca", "nextState": "chewie_deep" },
        {
          "text": "Tell me about the Rebel Alliance",
          "nextState": "rebel_deep"
        },
        {
          "text": "Give me a random Han Solo quote",
          "nextState": "quotes_deep"
        }
      ]
    },
    "adventures_deep": {
      "message": "Well, I've been smuggling spice across the galaxy, dodging Imperial patrols, and making the Kessel Run in less than twelve parsecs. It's been quite the adventure!",
      "quickReplies": [
        { "text": "Tell me about the Kessel Run!", "nextState": "kessel_deep" },
        {
          "text": "How do you dodge Imperial patrols?",
          "nextState": "imperial_deep"
        },
        { "text": "Any smuggling tips?", "nextState": "smuggling_deep" },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "falcon_deep": {
      "message": "The Millennium Falcon? She's the fastest ship in the galaxy! Made the Kessel Run in less than twelve parsecs. She may not look like much, but she's got it where it counts, kid.",
      "quickReplies": [
        {
          "text": "What modifications did you make?",
          "nextState": "mods_deep"
        },
        { "text": "What makes her so fast?", "nextState": "speed_deep" },
        { "text": "How do you maintain her?", "nextState": "maintenance_deep" },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "chewie_deep": {
      "message": "Chewie? He's my co-pilot and best friend. Loyal as they come, and don't let his appearance fool you - he's a great shot with a bowcaster!",
      "quickReplies": [
        { "text": "How did you meet Chewie?", "nextState": "meeting_deep" },
        {
          "text": "Tell me about Wookiee culture!",
          "nextState": "culture_deep"
        },
        { "text": "Best moments with Chewie?", "nextState": "moments_deep" },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "rebel_deep": {
      "message": "The Rebel Alliance? They're fighting against the Empire for freedom across the galaxy. I've been helping them out when I can, though I prefer to stay independent.",
      "quickReplies": [
        {
          "text": "Why do you help the Rebellion?",
          "nextState": "motivation_deep"
        },
        { "text": "Tell me about Rebel heroes!", "nextState": "heroes_deep" },
        {
          "text": "What do you think of the Empire?",
          "nextState": "empire_deep"
        },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "quotes_deep": {
      "message": [
        "\"Sometimes, I amaze even myself.\" - Han Solo",
        "\"I know.\" - Han Solo",
        "\"Never tell me the odds!\" - Han Solo",
        "\"I've got a bad feeling about this.\" - Han Solo",
        "\"Great, kid. Don't get cocky.\" - Han Solo",
        "\"Hokey religions and ancient weapons are no match for a good blaster at your side, kid.\" - Han Solo"
      ],
      "quickReplies": [
        { "text": "Give me another quote!", "nextState": "more_quotes" },
        { "text": "What's your favorite quote?", "nextState": "favorite_deep" },
        {
          "text": "Tell me the story behind a quote!",
          "nextState": "story_deep"
        },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "more_quotes": {
      "message": [
        "\"Never tell me the odds!\" - Han Solo",
        "\"I've got a bad feeling about this.\" - Han Solo",
        "\"Great, kid. Don't get cocky.\" - Han Solo",
        "\"Sometimes, I amaze even myself.\" - Han Solo",
        "\"That's not how the Force works!\" - Han Solo",
        "\"Chewie, we're home.\" - Han Solo"
      ],
      "quickReplies": [
        { "text": "Give me another quote!", "nextState": "quotes_deep" },
        { "text": "What's your favorite quote?", "nextState": "favorite_deep" },
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "kessel_deep": {
      "message": "The Kessel Run? That's my specialty! I made it in less than twelve parsecs. Most smugglers take longer routes, but I found a shortcut through the Maw - a cluster of black holes. Risky, but worth it! The Falcon's hyperdrive modifications made it possible.",
      "quickReplies": [
        { "text": "Any Kessel Run tips?", "nextState": "kessel_tips" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "kessel_tips": {
      "message": "Know your ship inside and out! The Falcon's modifications are key - Class 0.5 hyperdrive, military-grade shields, and Chewie's expert navigation. Trust your instincts, but also trust your instruments. And remember: sometimes the shortest route isn't the safest!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "imperial_deep": {
      "message": "You gotta be quick and unpredictable! I've got sensors that can detect Imperial ships from light-years away. Sometimes I hide in asteroid fields, other times I use solar flares to mask my signature. The key is never taking the same route twice!",
      "quickReplies": [
        {
          "text": "Tell me about Imperial tactics!",
          "nextState": "imperial_tactics"
        },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "imperial_tactics": {
      "message": "The Empire's predictable! They always follow protocol, use standard patrol routes, and rely too much on their superior numbers. The key is being unpredictable - change course randomly, use civilian traffic as cover, and never underestimate the power of a good bluff!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "smuggling_deep": {
      "message": "First rule: trust no one, except Chewie. Second: always have a backup plan. Third: know your cargo - some things are worth more than others. Fourth: keep your ship in top condition. And fifth: never underestimate the Empire's persistence!",
      "quickReplies": [
        {
          "text": "Tell me a smuggling story!",
          "nextState": "smuggling_stories"
        },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "smuggling_stories": {
      "message": "There was this time I smuggled a crate of Corellian wine past three Imperial checkpoints! I disguised it as engine coolant and had Chewie growl at the inspectors. They were so scared of him they didn't even check the cargo. Sometimes the best smuggling tool is a good Wookiee!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "mods_deep": {
      "message": "I've modified her hyperdrive to be faster than anything the Empire has. Added military-grade deflector shields, upgraded the quad laser cannons, and installed a Class 0.5 hyperdrive. She's got more firepower than most Imperial fighters!",
      "quickReplies": [
        {
          "text": "Tell me about the modifications!",
          "nextState": "modification_stories"
        },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "modification_stories": {
      "message": "The hyperdrive modifications took months! I had to scavenge parts from three different Imperial ships and bribe a Bothan engineer to help install them. The shields came from a crashed Rebel transport, and the laser cannons... well, let's just say they're not exactly legal!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "speed_deep": {
      "message": "It's all about the hyperdrive modifications and knowing the right routes. I've stripped out unnecessary weight, optimized the power distribution, and installed experimental components. Plus, I know shortcuts through hyperspace that most pilots wouldn't dare try!",
      "quickReplies": [
        { "text": "More speed secrets!", "nextState": "speed_secrets_more" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "speed_secrets_more": {
      "message": "The real secret isn't just the modifications - it's knowing hyperspace like the back of your hand! I've mapped routes that most pilots wouldn't dare try. The Falcon's got a personality too - she responds better to gentle handling than brute force. Treat her right, and she'll get you anywhere!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "maintenance_deep": {
      "message": "Chewie and I maintain her constantly! We check the hyperdrive every few runs, keep the shields calibrated, and make sure the weapons are always ready. A ship is only as good as its maintenance. We've got spare parts stashed all over the galaxy!",
      "quickReplies": [
        {
          "text": "Tell me maintenance stories!",
          "nextState": "maintenance_stories"
        },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "maintenance_stories": {
      "message": "Chewie and I have rebuilt the Falcon from scratch three times! Once after a crash on Hoth, once after a battle with Imperial fighters, and once when we had to replace the entire hyperdrive core. She's like a living thing - you have to understand her quirks and treat her with respect!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "meeting_deep": {
      "message": "I met Chewie when I was working for Jabba the Hutt. He was enslaved, and I helped him escape. We've been partners ever since. He's saved my life more times than I can count, and I've done the same for him. That's what friendship is about!",
      "quickReplies": [
        { "text": "Tell me about Jabba!", "nextState": "jabba_story" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "jabba_story": {
      "message": "Jabba the Hutt? He's a slimy, greedy slug who thinks he owns everyone! I worked for him for a while, but I couldn't stand seeing Chewie enslaved. So I helped him escape, and we've been partners ever since. Sometimes doing the right thing costs you everything, but it's worth it!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "culture_deep": {
      "message": "Wookiees are incredibly loyal and honorable. They value family above all else and have a strong sense of justice. Chewie's got a life debt to me, but honestly, I think we'd be friends regardless. He's the most trustworthy being in the galaxy!",
      "quickReplies": [
        { "text": "Tell me Wookiee stories!", "nextState": "wookiee_stories" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "wookiee_stories": {
      "message": "Wookiees are incredible! They can rip your arms off, but they're also the most loyal friends you'll ever have. Chewie's saved my life more times than I can count, and I've done the same for him. That's what friendship is about - being there for each other, no matter what!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "moments_deep": {
      "message": "Too many to count! There was the time he ripped a stormtrooper's arms off, or when he fixed the hyperdrive mid-jump. But my favorite is just sitting in the cockpit, him growling about Imperial tactics while I plot our next move. He's family.",
      "quickReplies": [
        {
          "text": "Tell me more best moments!",
          "nextState": "best_moments_more"
        },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "best_moments_more": {
      "message": "There was the time Chewie fixed the hyperdrive while we were being chased by Imperial fighters! Or when he carried me out of a burning building on Cloud City. But my favorite is just sitting in the cockpit, him growling about Imperial tactics while I plot our next move. He's family!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "motivation_deep": {
      "message": "I started helping for the money, but now it's personal. The Empire destroyed my homeworld, enslaved my friends, and made life miserable for everyone. Sometimes you gotta pick a side, even if you're not the hero type. Freedom's worth fighting for.",
      "quickReplies": [
        { "text": "Tell me about freedom!", "nextState": "freedom_stories" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "freedom_stories": {
      "message": "Freedom isn't free! The Empire took everything from me - my homeworld, my friends, my way of life. But they can't take my spirit! Every time I help the Rebellion, I'm fighting for a galaxy where people can live without fear. That's worth fighting for!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "heroes_deep": {
      "message": "Luke's got potential, though he's still green. Leia's got more guts than most soldiers I've met. And don't get me started on Obi-Wan - that old wizard taught me more than he'll ever know. But the real heroes are the everyday people fighting for freedom.",
      "quickReplies": [
        { "text": "Tell me about the heroes!", "nextState": "hero_stories" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "hero_stories": {
      "message": "Luke's got the heart of a hero, even if he's still green. Leia's got more courage than most soldiers I've met. And Obi-Wan... that old wizard taught me more about doing the right thing than he'll ever know. But the real heroes are the everyday people fighting for freedom!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "empire_deep": {
      "message": "The Empire? They're bullies with fancy toys. They think fear and intimidation will keep everyone in line, but they're wrong. People will always fight for freedom, and the Empire's too arrogant to see it coming. Their days are numbered!",
      "quickReplies": [
        { "text": "Tell me Empire stories!", "nextState": "empire_stories" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "empire_stories": {
      "message": "The Empire's built on fear and intimidation! They think having the biggest guns and the most ships makes them invincible. But they're wrong! People will always fight for freedom, and the Empire's too arrogant to see it coming. Their days are numbered!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "favorite_deep": {
      "message": "My favorite? 'Never tell me the odds!' It sums up my whole philosophy. Life's about taking chances and not letting statistics stop you from doing what's right. Plus, it really annoys C-3PO!",
      "quickReplies": [
        { "text": "Tell me about your philosophy!", "nextState": "philosophy" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "philosophy": {
      "message": "Life's about taking chances and not letting the odds stop you from doing what's right! I've been called a scoundrel, a smuggler, even a hero. But I'm just a guy trying to do the right thing in a galaxy that doesn't make it easy. Sometimes you gotta trust your instincts!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    },
    "story_deep": {
      "message": "Well, 'I know' was my response to Leia when she said 'I love you.' Some people think I was being cold, but I was trying to be brave. I knew I might not make it back, and I wanted her to know I felt the same way. Sometimes the simplest words say the most.",
      "quickReplies": [
        { "text": "Tell me about love!", "nextState": "love_stories" },
        { "text": "Go back", "nextState": "welcome" }
      ]
    },
    "love_stories": {
      "message": "Love's complicated! When Leia said 'I love you,' I knew I might not make it back. So I said 'I know' - not because I was being cold, but because I was trying to be brave. Sometimes the simplest words say the most. And sometimes love means letting someone go!",
      "quickReplies": [
        { "text": "Go back to main menu", "nextState": "welcome" }
      ]
    }
  }
}
